---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Architecture.ContinuousRailType
source: html/c001de7e-3bf8-3105-73a6-2422690fa849.htm
---
# ContinuousRailType Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.